module.exports.config = {
    name: "hanuman chalisha",
    version: "1.0.0",
    hasPermssion: 2,
    credits: "𝐏𝐫𝐢𝐲𝐚𝐧𝐬𝐡 𝐑𝐚𝐣𝐩𝐮𝐭",
    description: "War In Chatbox",
    commandCategory: "wargroup",
    usages: "[hanuman]",
    cooldowns: 7,
    dependencies: {
        "fs-extra": "",
        "axios": ""
    }
}

module.exports.run = async function({ api, args, Users, event}) {
 var mention = Object.keys(event.mentions)[0];
    
 let name =  event.mentions[mention];
    var arraytag = [];
        arraytag.push({id: mention});
    var a = function (a) { api.sendMessage(a, event.threadID); }
a("श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि।बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि।। बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार बल बुद्धि बिद्या देहु मोहिं, हरहु कलेस बिकार।। ");
setTimeout(() => {a({body: "🙏जय हनुमान ज्ञान गुन सागर जय कपीस तिहुं लोक उजागर" })}, 3000);
setTimeout(() => {a({body: "🙏रामदूत अतुलित बल धामा।अंजनि पुत्र पवनसुत नामा।।"})}, 6000);
setTimeout(() => {a({body: "महाबीर बिक्रम बजरंगी।कुमति निवार सुमति के संगी।।🙏" })}, 9000);
setTimeout(() => {a({body: "कंचन बरन बिराज सुबेसा।कानन कुंडल कुंचित केसा।❤️" })}, 12000);
setTimeout(() => {a({body: "हाथ बज्र औ ध्वजा बिराजै।कांधे मूंज जनेऊ साजै❤️" })}, 15000);
setTimeout(() => {a({body: "संकर सुवन केसरीनंदन।तेज प्रताप महा जग बन्दन।।" })}, 18000);
setTimeout(() => {a({body: "विद्यावान गुनी अति चातुर।राम काज करिबे को आतुर।।" })}, 21000);
setTimeout(() => {a({body: "❤️" })}, 24000);
setTimeout(() => {a({body: " प्रभु चरित्र सुनिबे को रसिया राम लखन सीता मन बसिया।।🙏" })}, 27000);
setTimeout(() => {a({body: "सूक्ष्म रूप धरि सियहिं दिखावा बिकट रूप धरि लंक जरावा🙏" })}, 300000);
setTimeout(() => {a({body: "भीम रूप धरि असुर संहारे रामचन्द्र के काज संवारे।।" })}, 33000);
setTimeout(() => {a({body: "🙏लाय सजीवन लखन जियाये श्री रघुबीर हरषि उर लाये।।" })}, 34000);
setTimeout(() => {a({body: "❤️रघुपति कीन्ही बहुत बड़ाई तुम मम प्रिय भरतहि सम भाई।" })}, 36000);
setTimeout(() => {a({body: "सहस बदन तुम्हरो जस गावैं अस कहि श्रीपति कण्ठ लगावैं।।" })}, 39000);
setTimeout(() => {a({body: " सनकादिक ब्रह्मादि मुनीसा नारद सारद सहित अहीसा" })}, 40000);
setTimeout(() => {a({body: "🙏जम कुबेर दिगपाल जहां ते कबि कोबिद कहि सके कहां ते" })}, 43000);
setTimeout(() => {a({body: "❤️तुम उपकार सुग्रीवहिं कीन्हा राम मिलाय राज पद दीन्हा।।🙏" })}, 46000);
setTimeout(() => {a({body: " तुम्हरो मंत्र बिभीषन माना लंकेश्वर भए सब जग जाना🙏।।" })} , 49000);
setTimeout(() => {a({body: " 😍जुग सहस्र जोजन पर भानु लील्यो ताहि मधुर फल जानू।।" })} , 52000);
setTimeout(() => {a({body: " 🙏❤️प्रभु मुद्रिका मेलि मुख माहीं जलधि लांघि गये अचरज नाहीं।।" })} , 55000);
setTimeout(() => {a({body: " दुर्गम काज जगत के जेते सुगम अनुग्रह तुम्हरे तेते।।🙏❤️" })} , 58000);
setTimeout(() => {a({body: " 😍राम दुआरे तुम रखवारे होत न आज्ञा बिनु पैसारे" })} , 60000);
setTimeout(() => {a({body: " सब सुख लहै तुम्हारी सरना तुम रच्छक काहू को डर ना।।🙏" })} , 63000);
setTimeout(() => {a({body: " 😍❤️आपन तेज सम्हारो आपै तीनों लोक हांक तें कांपै🙏।।" })} , 66000);
setTimeout(() => {a({body: " ❤️भूत पिसाच निकट नहिं आवै महाबीर जब नाम सुनावै।।" })} , 69000);
setTimeout(() => {a({body: " ❤️नासै रोग हरे सब पीरा जपत निरन्तर हनुमत बीरा🙏।।" })} , 72000);
setTimeout(() => {a({body: " 😍संकट तें हनुमान छुड़ावै मन क्रम बचन ध्यान जो लावै।🙏" })} , 75000);
setTimeout(() => {a({body: " सब पर राम तपस्वी राजा तिन के काज सकल तुम साजा❤️।।" })} , 78000);
setTimeout(() => {a({body: " 🙏और मनोरथ जो कोई लावै सोई अमित जीवन फल पावै।।❤️🙏" })} , 81000);
setTimeout(() => {a({body: " 😍चारों जुग परताप तुम्हारा है परसिद्ध जगत उजियारा।।🙏" })}, 84000);
setTimeout(() => {a({body: " साधु संत के तुम रखवारे असुर निकन्दन राम दुलारे।।🙏❤️" })} , 87000);

}
                 
